
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/13114152299)


<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_dns_record.homepage
  * cloudflare_dns_record.homepage__www
  * cloudflare_pages_domain.clov3r-cc
  * cloudflare_pages_domain.www-clov3r-cc
  * cloudflare_zero_trust_access_application.pxmx01-mng
  * cloudflare_zero_trust_access_policy.allow_github


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.homepage will be created
  + resource "cloudflare_dns_record" "homepage" {
      + comment             = "for my homepage in Cloudflare Pages"
      + comment_modified_on = (known after apply)
      + content             = "my-home.pages.dev"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "clov3r.cc"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_dns_record.homepage__www will be created
  + resource "cloudflare_dns_record" "homepage__www" {
      + comment             = "for my homepage in Cloudflare Pages"
      + comment_modified_on = (known after apply)
      + content             = "my-home.pages.dev"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "www"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_pages_domain.clov3r-cc will be created
  + resource "cloudflare_pages_domain" "clov3r-cc" {
      + account_id            = "fff06038a70892193e0fa1e9e270436a"
      + certificate_authority = (known after apply)
      + created_on            = (known after apply)
      + domain_id             = (known after apply)
      + id                    = (known after apply)
      + name                  = "clov3r.cc"
      + project_name          = "my-home"
      + status                = (known after apply)
      + validation_data       = (known after apply)
      + verification_data     = (known after apply)
      + zone_tag              = (known after apply)
    }

  # cloudflare_pages_domain.www-clov3r-cc will be created
  + resource "cloudflare_pages_domain" "www-clov3r-cc" {
      + account_id            = "fff06038a70892193e0fa1e9e270436a"
      + certificate_authority = (known after apply)
      + created_on            = (known after apply)
      + domain_id             = (known after apply)
      + id                    = (known after apply)
      + name                  = "www.clov3r.cc"
      + project_name          = "my-home"
      + status                = (known after apply)
      + validation_data       = (known after apply)
      + verification_data     = (known after apply)
      + zone_tag              = (known after apply)
    }

  # cloudflare_zero_trust_access_application.pxmx01-mng will be created
  + resource "cloudflare_zero_trust_access_application" "pxmx01-mng" {
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + cors_headers                 = (known after apply)
      + created_at                   = (known after apply)
      + destinations                 = (known after apply)
      + domain                       = "pxmx01-mng"
      + enable_binding_cookie        = false
      + footer_links                 = (known after apply)
      + http_only_cookie_attribute   = true
      + id                           = (known after apply)
      + landing_page_design          = (known after apply)
      + name                         = "Access application for pxmx01-mng"
      + path_cookie_attribute        = false
      + policies                     = [
          + {
              + connection_rules = (known after apply)
              + exclude          = (known after apply)
              + id               = (known after apply)
              + include          = (known after apply)
              + precedence       = 1
              + require          = (known after apply)
            },
          + {
              + connection_rules = (known after apply)
              + exclude          = (known after apply)
              + id               = "24688b5e-f084-4bc2-8671-1fa1c380bb24"
              + include          = (known after apply)
              + precedence       = 2
              + require          = (known after apply)
            },
        ]
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + target_criteria              = (known after apply)
      + updated_at                   = (known after apply)
      + zone_id                      = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_zero_trust_access_policy.allow_github will be created
  + resource "cloudflare_zero_trust_access_policy" "allow_github" {
      + account_id                     = "fff06038a70892193e0fa1e9e270436a"
      + app_count                      = (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      + created_at                     = (known after apply)
      + decision                       = "allow"
      + exclude                        = (known after apply)
      + id                             = (known after apply)
      + include                        = [
          + {
              + group = {
                  + id = "82e31d68-40a9-458c-a3f8-da668c6f2db7"
                }
            },
        ]
      + isolation_required             = false
      + name                           = "To SSO with GitHub"
      + purpose_justification_required = false
      + require                        = (known after apply)
      + reusable                       = (known after apply)
      + session_duration               = "24h"
      + updated_at                     = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Resource not found

  with cloudflare_dns_record.homepage,
  on my_homepage.tf line 32, in resource "cloudflare_dns_record" "homepage":
  32: resource "cloudflare_dns_record" "homepage" {

The resource was not found on the server and will be removed from state.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Resource not found

  with cloudflare_dns_record.homepage,
  on my_homepage.tf line 32, in resource "cloudflare_dns_record" "homepage":
  32: resource "cloudflare_dns_record" "homepage" {

The resource was not found on the server and will be removed from state.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":68,"Program":"tfcmt","SHA1":"360699d097547fb479f5c80465ed32ae601f8fbd","Vars":{},"WorkflowName":"Terraform CI"} -->